** Emacs version

#+BEGIN_SRC emacs-lisp :tangle yes
;; check emacs version
(if (version< emacs-version "25.1")
    ((message "Old Emacs, YMMV")
     (kill-emacs))
  (message "Why not try 26.1?"))

(message "Spinning up %s@%s using %s"
	 system-name
	 user-login-name
	 ;;user-emacs-directory
	 user-init-file)
#+END_SRC

#+RESULTS:
: Spinning up rwoodard@rwoodard using nil

** default face/frame

#+BEGIN_SRC emacs-lisp :tangle yes
;;  t for a termcap frame (a character-only terminal),
;; ‘x’ for an Emacs frame that is really an X window,
;; ‘w32’ for an Emacs frame that is a window on MS-Windows display,
;; ‘ns’ for an Emacs frame on a GNUstep or Macintosh Cocoa display,

;; Readability counts.
;; `C-x C-+’ and ‘C-x C--’
;; C-x C-0 to reset.
(when (eq is-linux t)
  ;; Readable font
  (when (eq window-system 'x)
    (set-face-attribute 'default nil :height 200)
    (add-to-list 'initial-frame-alist '(height . 40))
    (add-to-list 'initial-frame-alist '(width . 80))
    (add-to-list 'default-frame-alist '(height . 40))
    (add-to-list 'default-frame-alist '(width . 80))))

(when (eq is-mac t)

  ;; Macbook built-in display.
  (when (eq window-system 'ns)
    ;; On Mac, use Command-t to bring up font menu.
    (set-face-attribute 'default nil :height 180)
    ;;(set-face-attribute 'default nil :height 220)
    ;;(set-face-attribute 'default nil :height 240)
    (add-to-list 'initial-frame-alist '(height . 33))
    (add-to-list 'initial-frame-alist '(width . 80))
    (add-to-list 'default-frame-alist '(height . 33))
    (add-to-list 'default-frame-alist '(width . 80))))
#+END_SRC

#+RESULTS:
: ((width . 80) (height . 33))

* My key bindings

#+BEGIN_SRC emacs-lisp :tangle yes
;; See examples at bottom of this file of ways to set keys.

;; Global.

(global-set-key [end]
		'move-end-of-line)
(global-set-key [home]
		'move-beginning-of-line)
(global-set-key (kbd "s-s")
		'isearch-forward)  ;; Mac command key
(global-set-key (kbd "s-r")
		'isearch-backward)  ;; Mac command key

(add-hook 'isearch-mode-hook
	  (lambda ()

	    (define-key isearch-mode-map (kbd "s-s")
	      'isearch-repeat-forward)
	    (define-key isearch-mode-map (kbd "s-r")
	      'isearch-repeat-backward)
	    ))

;; Make only one window.
(global-set-key [f1]
		'delete-other-windows)

;; Make this window go away.
(global-set-key [S-f1]
		'delete-window)

;; Go to table of key bindings.
(global-set-key [M-f1]
		(lambda ()
		  (interactive)
		  (bookmark-jump "keys")
		  (recenter-top-bottom 1)))

;; Split window in half (top and bottom).
(global-set-key [f2]
		(lambda ()
		  (interactive)
		  (split-window-vertically)
		  (other-window 1)))

;; Split window in half (left and right).
(global-set-key [S-f2]
		(lambda ()
		  (interactive)
		  (split-window-horizontally)
		  (other-window 1)))

;; Bury buffer.
(global-set-key [f3]
		'bury-buffer)

;; Kill buffer (require two key presses since it's a kill).
(global-set-key [S-f3]
		'kill-buffer)

;; Set target buffer for sending commands to
(defun my/set-target-buffer ()
  "Tag as target buffer for shell commands"
  (interactive)
  (setq my/target-proc (get-buffer-process (current-buffer)))
  (message (concat "New my/target-proc is " (buffer-name)))
  )
(global-set-key [C-S-f4] 'my/set-target-buffer)
(global-set-key [M-s-f4] 'my/sh-send-line-or-region)

;; Switch to most recent buffer.
(global-set-key [f5]
		(lambda ()
		  (interactive)
		  (switch-to-buffer nil)))

;; JFGI
(global-set-key [S-f5]
		'browse-url)

;; Go to next window.
(global-set-key [f6]
		(lambda ()
		  (interactive)
		  (other-window 1)))

;; Go to previous window.
(global-set-key [S-f6]
		(lambda ()
		  (interactive)
		  (other-window -1)))

;; helm version of buffers.
(global-set-key [f8]
		'helm-mini)

;; speedbar
(global-set-key [S-f8]
		'sr-speedbar-toggle)

;; menu that a mouse would find.
(global-set-key [M-f8]
		'tmm-menubar)

;; Info!
(global-set-key [C-f8]
		'info)

;; Top and bottom of buffer.
(global-set-key [S-f9]
		'beginning-of-buffer)

(global-set-key [S-f10]
		(lambda ()
		  (interactive)
		  (goto-char (point-max))))

(global-set-key [S-f11]
		'helm-find-files)

(global-set-key [f11]
		'save-buffer)

(global-set-key [C-f12]
		'eval-last-sexp)

;; temp place for one-off keyboard macros, for now
;; (global-set-key [f14]
;;                 'akmtdfgen)

(add-hook 'org-mode-hook
	  (lambda ()

	    (define-key org-mode-map [M-f3]
	      'org-babel-remove-result-one-or-many)

	    ;; Remove all results in buffer...dangerous!  But can undo!
	    (define-key org-mode-map [C-f3]
	      (lambda ()
		(interactive)
		(org-babel-remove-result-one-or-many t)))

	    (define-key org-mode-map [f4]
	      'org-ctrl-c-ctrl-c)

	    (define-key org-mode-map [f9]
	      (lambda ()
		(interactive)
		(org-previous-block nil)
		;; (org-show-block-all)
		(outline-show-all)))

	    (define-key org-mode-map [f10]
	      (lambda ()
		(interactive)
		(org-next-block nil)
		;; (org-show-block-all)
		(outline-show-all)))

	    ;; Toggle hide of all results.
	    (define-key org-mode-map [S-f9]
	      'org-babel-hide-result-toggle)

	    ;; Go to results section of current block.
	    (define-key org-mode-map [S-f10]
	      (lambda ()
		(interactive)
		(let ((location (org-babel-where-is-src-block-result)))
		  (when location
		    (goto-char location)))))

	    ;; (define-key org-mode-map [M-f9]
	    ;;   'insert-new-block-same-as-current)

	    ;; insert src block above
	    (define-key org-mode-map [M-f9]
	      (lambda ()
		(interactive)
		(org-babel-insert-block)))

	    (define-key org-mode-map [C-f9]
	      'org-show-block-all)

	    (define-key org-mode-map [C-f10]
	      'org-hide-block-all)

	    (define-key org-mode-map [C-S-f9]
	      'outline-show-all)

	    (define-key org-mode-map [C-S-f10]
	      'outline-hide-body)

	    ;; insert src block below
	    (define-key org-mode-map [M-f10]
	      (lambda ()
		(interactive)
		(org-babel-insert-block t)))

	    ;; (define-key org-mode-map [M-f10]
	    ;;   'insert-new-block-same-as-current-below)

	    (define-key org-mode-map [S-f4]
	      (lambda ()
		(interactive)
		(org-ctrl-c-ctrl-c)
		(org-next-block)))

	    (define-key org-mode-map [M-f4]
	      (lambda ()
		(interactive)
		(org-ctrl-c-ctrl-c)
		(insert-new-block-same-as-current-below)))


	    ;; (define-key org-mode-map [f12]
	    ;;   'my/org-babel-send-line-of-src-block)

	    (define-key org-mode-map [f12]
	      (lambda ()
		(interactive)
		(org-fill-paragraph)
		(save-buffer)
		(org-html-export-to-html)))

	    (define-key org-mode-map [M-f12]
	      'org-edit-special)

	    ))


(add-hook 'org-src-mode-hook
	  (lambda ()

	    ;; C-c C-c, standard Python mode, no elpy
	    (define-key org-src-mode-map [f4]
	      'python-shell-send-buffer)

	    (define-key org-src-mode-map [M-f12]
	      'org-edit-src-exit)

	    (define-key org-src-mode-map [f9]
	      (lambda ()
		(interactive)
		(org-previous-block)
		(org-show-block-all)))


	    ))


(add-hook 'sh-mode-hook
	  (lambda()

	    (define-key sh-mode-map [f12]
	      (lambda ()
		(interactive)
		(my/sh-send-line-or-region)
		))


	    (define-key sh-mode-map [S-f12]
	      (lambda ()
		(interactive)
		(my/sh-send-line-or-region t)
		))

	    ;; (define-key sh-mode-map [f12]
	    ;;   (lambda ()
	    ;;     (interactive)
	    ;;     (let (b)
	    ;;       (setq b (get-buffer (current-buffer)))
	    ;;       (sh-send-line-or-region-and-step)
	    ;;       (goto-char (point-max))
	    ;;       (switch-to-buffer-other-window b)
	    ;;     )))


	    ;; (define-key sh-mode-map [S-f12]
	    ;;   (lambda ()
	    ;;     (interactive)
	    ;;     (let (b)
	    ;;       (setq b (get-buffer (current-buffer)))
	    ;;       (sh-send-line-or-region-and-step)
	    ;;       (goto-char (point-max))
	    ;;       (switch-to-buffer-other-window b)
	    ;;       (next-line)
	    ;;       (end-of-line))))

	    ))


;; Piggybacking on sh-mode to send to spark-shell.
(add-hook 'scala-mode-hook
	  (lambda()

	    (define-key scala-mode-map [f12]
	      (lambda ()
		(interactive)
		(my/sh-send-line-or-region)
		))


	    (define-key scala-mode-map [S-f12]
	      (lambda ()
		(interactive)
		(my/sh-send-line-or-region t)
		))

	    ))


(defun my/eval-line (mode-specific-eval)
  "Send entire current line to sh, elisp, python or whatever."
  (let ((start (line-beginning-position))
	(end (line-end-position)))
    (funcall mode-specific-eval start end)))


(add-hook 'python-mode-hook
	  (lambda()

	    (define-key python-mode-map [f12]
	      (lambda ()
		(interactive)
		(my/eval-line 'python-shell-send-region)))

	    (define-key python-mode-map [S-f12]
	      (lambda ()
		(interactive)
		(my/eval-line 'python-shell-send-region)
		(next-line)
		(end-of-line)))


	    ;; Sometimes this is useful, like over ssh to BARE.
	    (define-key python-mode-map [f12]
	      (lambda ()
		(interactive)
		(my/sh-send-line-or-region)
		))


	    (define-key python-mode-map [S-f12]
	      (lambda ()
		(interactive)
		(my/sh-send-line-or-region t)
		))


	    ))


(add-hook 'emacs-lisp-mode-hook
	  (lambda()

	    (define-key emacs-lisp-mode-map [f12]
	      (lambda ()
		(interactive)
		(my/eval-line 'eval-region)))

	    ))



  ;; Cool things in term mode.
  ;;
  ;; ‘C-c C-l’
  ;; ‘C-c C-o’


  ;;;;
  ;;
  ;; Examples.
  ;;
  ;; From Info, examples of ways to set global keys:
  ;;
  ;; (global-set-key (kbd "C-c y") 'clipboard-yank)
  ;; (global-set-key (kbd "C-M-q") 'query-replace)
  ;; (global-set-key (kbd "<f5>") 'flyspell-mode)
  ;; (global-set-key (kbd "C-<f5>") 'linum-mode)
  ;; (global-set-key (kbd "C-<right>") 'forward-sentence)
  ;; (global-set-key (kbd "<mouse-2>") 'mouse-save-then-kill)

  ;; (global-set-key "\C-x\M-l" 'make-symbolic-link)

  ;; <TAB>
  ;; (global-set-key "\C-x\t" 'indent-rigidly)

  ;; (global-set-key [?\C-=] 'make-symbolic-link)
  ;; (global-set-key [?\M-\C-=] 'make-symbolic-link)
  ;; (global-set-key [?\H-a] 'make-symbolic-link)
  ;; (global-set-key [f7] 'make-symbolic-link)
  ;; (global-set-key [C-mouse-1] 'make-symbolic-link)

  ;; (global-set-key [?\C-z ?\M-l] 'make-symbolic-link)
#+END_SRC

#+RESULTS:
| (lambda nil (define-key emacs-lisp-mode-map [f12] (lambda nil (interactive) (my/eval-line (quote eval-region))))) | (lambda nil (define-key emacs-lisp-mode-map [f12] (function (lambda nil (interactive) (my/eval-line (quote eval-region)))))) | lisp-outline-setup | (lambda nil (lispy-mode) (eldoc-mode)) | ac-emacs-lisp-mode-setup | aggressive-indent-mode |

#+BEGIN_SRC emacs-lisp :tangle yes
(message "Reached end of my key bindings!")
#+END_SRC
* Local dictionary files, paths

#+BEGIN_SRC emacs-lisp :tangle yes
(when (eq is-mac t)

  (setenv
   "DICPATH"
   (concat (getenv "HOME") "/Library/Spelling")))

;; (setq ispell-hunspell-dictionary-alist ispell-local-dictionary-alist)
;;      '(("en_US" (concat (getenv "HOME") "/Library/Spelling/en_US.aff"))))

(setq ispell-hunspell-dict-paths-alist
      '(("en_US" "/Users/rwoodard/Library/Spelling/en_US.aff")))
	;; ("ru_RU" "C:/cygwin64/usr/share/myspell/ru_RU.aff")
	;; ("uk_UA" "C:/cygwin64/usr/share/myspell/uk_UA.aff")
	;; ("en_GB" "C:/cygwin64/usr/share/myspell/en_GB.aff")))
#+END_SRC

#+RESULTS:
| en_US | /Users/rwoodard/Library/Spelling/en_US.aff |

#+BEGIN_SRC emacs-lisp :tangle yes
(message "Reached end of * Local dictionary files, paths!")
#+END_SRC
